agency-services-transunion/src/examples/lastreq.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header/>
  <soap:Body>
    <ns1:IndicativeEnrichment xmlns:ns1="https://consumerconnectws.tui.transunion.com/">
      <ns1:request>
        <ns2:AccountCode xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">Q0NJdGtkQThtR3hwaQ</ns2:AccountCode>
        <ns2:AccountName xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">CC2BraveCredit</ns2:AccountName>
        <ns2:RequestKey xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">5a02062b-ab3e-4f94-b147-365a1f3791ff</ns2:RequestKey>
        <ns2:ClientKey xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">6b0fe15e-22f0-4797-8087-eaf2d17106ca</ns2:ClientKey>
        <ns2:Customer xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">
          <ns2:CurrentAddress>
            <ns2:AddressLine1>2409 Vandever  Ave</ns2:AddressLine1>
            <ns2:City>HOLLYWOOD</ns2:City>
            <ns2:State>FL</ns2:State>
            <ns2:Zipcode>33025</ns2:Zipcode>
          </ns2:CurrentAddress>
          <ns2:DateOfBirth>1957-09-01T00:00:00.000Z</ns2:DateOfBirth>
          <ns2:FullName>
            <ns2:FirstName>AARON</ns2:FirstName>
            <ns2:LastName>TESTA</ns2:LastName>
          </ns2:FullName>
          <ns2:Ssn>899010001</ns2:Ssn>
        </ns2:Customer>
        <ns2:ServiceBundleCode xmlns:ns2="https://consumerconnectws.tui.transunion.com/data">CC2BraveCreditIndicativeEnrichment</ns2:ServiceBundleCode>
      </ns1:request>
    </ns1:IndicativeEnrichment>
  </soap:Body>
</soap:Envelope>